; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p12---int100n150-m25---int100c110---s176---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 - fuellevel
)

(:init
(sum level0 level9 level9)
(sum level0 level16 level16)
(sum level0 level18 level18)
(sum level1 level9 level10)
(sum level1 level16 level17)
(sum level1 level18 level19)
(sum level2 level9 level11)
(sum level2 level16 level18)
(sum level2 level18 level20)
(sum level3 level9 level12)
(sum level3 level16 level19)
(sum level3 level18 level21)
(sum level4 level9 level13)
(sum level4 level16 level20)
(sum level4 level18 level22)
(sum level5 level9 level14)
(sum level5 level16 level21)
(sum level5 level18 level23)
(sum level6 level9 level15)
(sum level6 level16 level22)
(sum level6 level18 level24)
(sum level7 level9 level16)
(sum level7 level16 level23)
(sum level7 level18 level25)
(sum level8 level9 level17)
(sum level8 level16 level24)
(sum level8 level18 level26)
(sum level9 level9 level18)
(sum level9 level16 level25)
(sum level9 level18 level27)
(sum level10 level9 level19)
(sum level10 level16 level26)
(sum level10 level18 level28)
(sum level11 level9 level20)
(sum level11 level16 level27)
(sum level11 level18 level29)
(sum level12 level9 level21)
(sum level12 level16 level28)
(sum level12 level18 level30)
(sum level13 level9 level22)
(sum level13 level16 level29)
(sum level13 level18 level31)
(sum level14 level9 level23)
(sum level14 level16 level30)
(sum level14 level18 level32)
(sum level15 level9 level24)
(sum level15 level16 level31)
(sum level15 level18 level33)
(sum level16 level9 level25)
(sum level16 level16 level32)
(sum level16 level18 level34)
(sum level17 level9 level26)
(sum level17 level16 level33)
(sum level17 level18 level35)
(sum level18 level9 level27)
(sum level18 level16 level34)
(sum level18 level18 level36)
(sum level19 level9 level28)
(sum level19 level16 level35)
(sum level19 level18 level37)
(sum level20 level9 level29)
(sum level20 level16 level36)
(sum level20 level18 level38)
(sum level21 level9 level30)
(sum level21 level16 level37)
(sum level21 level18 level39)
(sum level22 level9 level31)
(sum level22 level16 level38)
(sum level22 level18 level40)
(sum level23 level9 level32)
(sum level23 level16 level39)
(sum level23 level18 level41)
(sum level24 level9 level33)
(sum level24 level16 level40)
(sum level24 level18 level42)
(sum level25 level9 level34)
(sum level25 level16 level41)
(sum level25 level18 level43)
(sum level26 level9 level35)
(sum level26 level16 level42)
(sum level26 level18 level44)
(sum level27 level9 level36)
(sum level27 level16 level43)
(sum level27 level18 level45)
(sum level28 level9 level37)
(sum level28 level16 level44)
(sum level28 level18 level46)
(sum level29 level9 level38)
(sum level29 level16 level45)
(sum level29 level18 level47)
(sum level30 level9 level39)
(sum level30 level16 level46)
(sum level30 level18 level48)
(sum level31 level9 level40)
(sum level31 level16 level47)
(sum level31 level18 level49)
(sum level32 level9 level41)
(sum level32 level16 level48)
(sum level32 level18 level50)
(sum level33 level9 level42)
(sum level33 level16 level49)
(sum level33 level18 level51)
(sum level34 level9 level43)
(sum level34 level16 level50)
(sum level34 level18 level52)
(sum level35 level9 level44)
(sum level35 level16 level51)
(sum level35 level18 level53)
(sum level36 level9 level45)
(sum level36 level16 level52)
(sum level36 level18 level54)
(sum level37 level9 level46)
(sum level37 level16 level53)
(sum level37 level18 level55)
(sum level38 level9 level47)
(sum level38 level16 level54)
(sum level39 level9 level48)
(sum level39 level16 level55)
(sum level40 level9 level49)
(sum level41 level9 level50)
(sum level42 level9 level51)
(sum level43 level9 level52)
(sum level44 level9 level53)
(sum level45 level9 level54)
(sum level46 level9 level55)

(connected l0 l1)
(fuelcost level16 l0 l1)
(connected l0 l2)
(fuelcost level18 l0 l2)
(connected l1 l0)
(fuelcost level16 l1 l0)
(connected l1 l2)
(fuelcost level9 l1 l2)
(connected l2 l0)
(fuelcost level18 l2 l0)
(connected l2 l1)
(fuelcost level9 l2 l1)

(at t0 l0)
(fuel t0 level55)
(= (total-cost) 0)

(at p0 l0)
(at p1 l0)
(at p2 l1)
(at p3 l2)
(at p4 l1)
(at p5 l2)
(at p6 l1)
(at p7 l0)
(at p8 l2)
(at p9 l1)
(at p10 l2)
(at p11 l0)
)

(:goal
(and
(at p0 l1)
(at p1 l1)
(at p2 l2)
(at p3 l0)
(at p4 l2)
(at p5 l1)
(at p6 l0)
(at p7 l2)
(at p8 l0)
(at p9 l2)
(at p10 l0)
(at p11 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p7 t0 l0)
   deleted: (at p7 l0)
   added: (in p7 t0)
   goals met: 0 of 12
2. (load p11 t0 l0)
   deleted: (at p11 l0)
   added: (in p11 t0)
   goals met: 0 of 12
3. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 0 of 12
4. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 0 of 12
5. (drive t0 l0 l2 level37 level18 level55)
   deleted: (at t0 l0) (fuel t0 level55)
   added: (at t0 l2) (fuel t0 level37)
   goals met: 0 of 12
6. (load p5 t0 l2)
   deleted: (at p5 l2)
   added: (in p5 t0)
   goals met: 0 of 12
7. (load p10 t0 l2)
   deleted: (at p10 l2)
   added: (in p10 t0)
   goals met: 0 of 12
8. (drive t0 l2 l1 level28 level9 level37)
   deleted: (at t0 l2) (fuel t0 level37)
   added: (at t0 l1) (fuel t0 level28)
   goals met: 0 of 12
9. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 0 of 12
10. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 0 of 12
11. (load p6 t0 l1)
   deleted: (at p6 l1)
   added: (in p6 t0)
   goals met: 0 of 12
12. (load p9 t0 l1)
   deleted: (at p9 l1)
   added: (in p9 t0)
   goals met: 0 of 12
13. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 1 of 12
14. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 2 of 12
15. (unload p11 t0 l1)
   deleted: (in p11 t0)
   added: (at p11 l1)
   goals met: 3 of 12
16. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 4 of 12
17. (drive t0 l1 l2 level19 level9 level28)
   deleted: (at t0 l1) (fuel t0 level28)
   added: (at t0 l2) (fuel t0 level19)
   goals met: 4 of 12
18. (load p3 t0 l2)
   deleted: (at p3 l2)
   added: (in p3 t0)
   goals met: 4 of 12
19. (load p8 t0 l2)
   deleted: (at p8 l2)
   added: (in p8 t0)
   goals met: 4 of 12
20. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 5 of 12
21. (unload p4 t0 l2)
   deleted: (in p4 t0)
   added: (at p4 l2)
   goals met: 6 of 12
22. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 7 of 12
23. (unload p9 t0 l2)
   deleted: (in p9 t0)
   added: (at p9 l2)
   goals met: 8 of 12
24. (drive t0 l2 l0 level1 level18 level19)
   deleted: (at t0 l2) (fuel t0 level19)
   added: (at t0 l0) (fuel t0 level1)
   goals met: 8 of 12
25. (unload p10 t0 l0)
   deleted: (in p10 t0)
   added: (at p10 l0)
   goals met: 9 of 12
26. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 10 of 12
27. (unload p6 t0 l0)
   deleted: (in p6 t0)
   added: (at p6 l0)
   goals met: 11 of 12
28. (unload p8 t0 l0)
   deleted: (in p8 t0)
   added: (at p8 l0)
   goals met: 12 of 12
